pyocd/pyOCD/pyocd/debug/svd/data/HC32F005.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>WDT</name>
            <description>desc WDT</description>
            <baseAddress>0x40000C00</baseAddress>
            <alternatePeripheral>BT0</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x86</size>
            </addressBlock>
            <registers>
                <register>
                    <name>RST</name>
                    <description>desc RST</description>
                    <addressOffset>0x80</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>WDTRST</name>
                            <description>desc WDTRST</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CON</name>
                    <description>desc CON</description>
                    <addressOffset>0x84</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xF</resetValue>
                    <resetMask>0xFFBF</resetMask>
                    <fields>
                        <field>
                            <name>WOV</name>
                            <description>desc WOV</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WDTR</name>
                            <description>desc WDTR</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WINT_EN</name>
                            <description>desc WINT_EN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WDINT</name>
                            <description>desc WDINT</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WCNTL</name>
                            <description>desc WCNTL</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
    </peripherals>
</device>
